# Description:
#   lucyちゃんが挨拶をしてくれる機能です。
#
# Dependencies:
#   None
#
# Configuration:
#   None
#
# Commands:
#   hubot おはよう - "おはようございます！"と返答
#   hubot おつかれ - "お疲れさまです！"と返答
#
# Notes:
#   初めて作りました。
#
# Author:
#   shitosa


module.exports = (robot) ->

  robot.hear /(お(疲|つか)れ|I'm tired.)/i, (msg) ->
    tired = msg.random [
        "お疲れ様です"
        "本当に疲れたにゃ？"
        "もうちょうい頑張れ"
        "人間も猫も楽じゃないにゃ"
        "おつかれにゃん"
        "明日も頑張るにゃん"
        "今日はよく働いたワン！"
    ]
    msg.reply "#{tired}"

  robot.hear /(お(やす|休)み|Good Night)/i, (msg) ->
    goodnight = msg.random [
      "おやすみにゃさい"
      "いい夢見ろよ"
      "ハブ　ア　ニャンダフル　ナイト"
      "おやすみにゃさい、また明日！"
      "明日は明日の風が吹くにゃ" 
      "もう私も寝ますね！おやすみにゃさい" 
      "おやすまなさい"
      "もう寝ちゃうんですか？"
      "今日は一緒に寝ますか？"
    ]
    msg.reply "#{goodnight}"
    
  robot.hear /(おは(|よ)(|う)|Good Morning)/i, (msg) ->
    morning = msg.random [
        "おはようございまっす"
        "きょうもいちにちがんばるにゃ"
        "残業しないようにするにゃ"
        "あ、おは！"
        "にゃんにゃにゃにゃんにゃ、にゃにゃにゃにゃにゃ〜ん♪"
        "今日やることを確認するにゃ"  
    ]
    msg.reply "#{morning}"

  robot.hear /(ありがとう|Thank)/i, (msg) ->
    thank = msg.random [
        "きにするにゃ"
        "どういたしまして"
        "あーざーす"
        "you are welcome"
        "OK"  
    ]
    msg.reply "#{thank}"
    
robot.hear /((うらな|占)い|運勢)/i, (msg) ->
    uranai = msg.random [
        "スーパー大吉！！おめでとうぅい！！"
        "う〜ん、言わないほうがいいかも"
        "にゃんにゃにゃにゃんにゃ、にゃにゃにゃにゃにゃ〜ん♪"
        "今日はスーパーラッキーデー！帰りにいつも通るあの店で、素敵な出会いが・・・"
        "中吉と吉どっちがうえかにゃ？"
        "秘密にゃ"
        "・・・"
        "中吉にゃ"
        "一番、リアクション取りづらいな、中吉"
        "中吉でございますぅ"
        "もう一回占う？？"
        "上向きの運勢にゃ"
        "下降気味。着陸するにゃ"
        "吉にゃ"
        "吉でよかったにゃん"
        "凶のラッキーカラーは紫"
        "いつもどおり"
        "ちょうど真ん中だからね"
        "吉って微妙じゃね！？"
        "凶にゃ"
        "凶はまだマシ"
        "そうだ、凶都にいこう"
        "最悪な日から始まる日もあるにゃ"
        "大凶か？いや大胸きん"
        "大・大・大凶"
    ]
    
#    robot.hear /(おはよ(|う)|Good Morning)/i, (msg) ->
#    morning = msg.random [
#        "おはようございまっす"
#        "きょうもいちにちがんばるにゃ"
#        "残業しないようにするにゃ"
#        "あ、おは！"
#        "にゃんにゃにゃにゃんにゃ、にゃにゃにゃにゃにゃ〜ん♪"
#        "今日やることを確認するにゃ"
#        ]
#    msg.reply "#{morning}"
